<meta charset="utf-8"/>

<hr><h2>Задача 1</h2><hr><br>

1. PHP и HTML. Напишите код на PHP<br>
В переменной $a лежит текст новости. В переменной $link лежит ссылка на страницу с полным текстом этой новости.
Нужно в переменную $b записать сокращенный текст новости по правилам:<br>
- обрезать до 180 символов<br>
- приписать многоточие<br>
- последние 2 слова и многоточие сделать ссылкой на полный текст новости.<br>
Какие проблемы вы видите в решении этой задачи? Что может пойти не так?<br>
Результат: ссылка на репозиторий с кодом и ваши комментарии.

<br>
<br>
<a href="./1/">Проверить</a><br><br>
<br>
<br>

<hr><h2>Задача 2</h2><hr><br>

2. Веб-разработка<br>
На диске лежит файл image.png, размер 20000 на 20000. Вывести картинку как баннер размером 200 на 100 пикселей.<br>
Обратите внимание на размер и пропорции, и подумайте о времени загрузки.<br>
Пришлите ссылку на репозиторий с решением<br>
Важно: решение требует использования PHP, сжатие картинки средствами HTML/CSS является некорректным решением.<br>

<br>
<a href="./2/">Проверить</a><br><br>
<a href="./2/code.php">Просмотреть код</a>
<br>
<br>

<hr><h2>Задача 3</h2><hr><br>

3. БД<br>
Чем отличаются эти запросы:<br>
1. SELECT * FROM a, b WHERE a.id=b.a_id;<br>
2. SELECT * FROM a JOIN b ON a.id=b.a_id;<br>
Пришлите ответ текстом<br>

<hr>Ответ :<br>
<hr><br>

<hr><h2>Задача 4</h2><hr><br>

4. Массивы
Дан массив из 100 элементов. Требуется вывести количество последовательных пар одинаковых элементов
Например: 1, 1, 2, 3, 4 -51, 12, 12, 12, -51
